theatrus/ksdk/platform/CMSIS/Include/device/MK24F25612/MK24F25612_registers.h
/*
 * Constants & macros for individual FMC_DATAW0SnMU bitfields
 */

/*!
 * @name Register FMC_DATAW0SnMU, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW0SnMU_data (0U)        /*!< Bit position for FMC_DATAW0SnMU_data. */
#define BM_FMC_DATAW0SnMU_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW0SnMU_data. */
#define BS_FMC_DATAW0SnMU_data (32U)       /*!< Bit field size in bits for FMC_DATAW0SnMU_data. */

/*! @brief Read current value of the FMC_DATAW0SnMU_data field. */
#define BR_FMC_DATAW0SnMU_data(x, n) (HW_FMC_DATAW0SnMU(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW0SnMU_data. */
#define BF_FMC_DATAW0SnMU_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW0SnMU_data) & BM_FMC_DATAW0SnMU_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW0SnMU_data(x, n, v) (HW_FMC_DATAW0SnMU_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW0SnML - Cache Data Storage (mid-lower word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW0SnML - Cache Data Storage (mid-lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-lower word (bits [63:32]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw0snml
{
    uint32_t U;
    struct _hw_fmc_dataw0snml_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [63:32] of data entry */
    } B;
} hw_fmc_dataw0snml_t;

/*!
 * @name Constants and macros for entire FMC_DATAW0SnML register
 */
/*@{*/
#define HW_FMC_DATAW0SnML_COUNT (4U)

#define HW_FMC_DATAW0SnML_ADDR(x, n) ((uint32_t)(x) + 0x208U + (0x10U * (n)))

#define HW_FMC_DATAW0SnML(x, n)  (*(__IO hw_fmc_dataw0snml_t *) HW_FMC_DATAW0SnML_ADDR(x, n))
#define HW_FMC_DATAW0SnML_RD(x, n) (HW_FMC_DATAW0SnML(x, n).U)
#define HW_FMC_DATAW0SnML_WR(x, n, v) (HW_FMC_DATAW0SnML(x, n).U = (v))
#define HW_FMC_DATAW0SnML_SET(x, n, v) (HW_FMC_DATAW0SnML_WR(x, n, HW_FMC_DATAW0SnML_RD(x, n) |  (v)))
#define HW_FMC_DATAW0SnML_CLR(x, n, v) (HW_FMC_DATAW0SnML_WR(x, n, HW_FMC_DATAW0SnML_RD(x, n) & ~(v)))
#define HW_FMC_DATAW0SnML_TOG(x, n, v) (HW_FMC_DATAW0SnML_WR(x, n, HW_FMC_DATAW0SnML_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW0SnML bitfields
 */

/*!
 * @name Register FMC_DATAW0SnML, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW0SnML_data (0U)        /*!< Bit position for FMC_DATAW0SnML_data. */
#define BM_FMC_DATAW0SnML_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW0SnML_data. */
#define BS_FMC_DATAW0SnML_data (32U)       /*!< Bit field size in bits for FMC_DATAW0SnML_data. */

/*! @brief Read current value of the FMC_DATAW0SnML_data field. */
#define BR_FMC_DATAW0SnML_data(x, n) (HW_FMC_DATAW0SnML(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW0SnML_data. */
#define BF_FMC_DATAW0SnML_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW0SnML_data) & BM_FMC_DATAW0SnML_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW0SnML_data(x, n, v) (HW_FMC_DATAW0SnML_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW0SnLM - Cache Data Storage (lowermost word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW0SnLM - Cache Data Storage (lowermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * lowermost word (bits [31:0]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw0snlm
{
    uint32_t U;
    struct _hw_fmc_dataw0snlm_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw0snlm_t;

/*!
 * @name Constants and macros for entire FMC_DATAW0SnLM register
 */
/*@{*/
#define HW_FMC_DATAW0SnLM_COUNT (4U)

#define HW_FMC_DATAW0SnLM_ADDR(x, n) ((uint32_t)(x) + 0x20CU + (0x10U * (n)))

#define HW_FMC_DATAW0SnLM(x, n)  (*(__IO hw_fmc_dataw0snlm_t *) HW_FMC_DATAW0SnLM_ADDR(x, n))
#define HW_FMC_DATAW0SnLM_RD(x, n) (HW_FMC_DATAW0SnLM(x, n).U)
#define HW_FMC_DATAW0SnLM_WR(x, n, v) (HW_FMC_DATAW0SnLM(x, n).U = (v))
#define HW_FMC_DATAW0SnLM_SET(x, n, v) (HW_FMC_DATAW0SnLM_WR(x, n, HW_FMC_DATAW0SnLM_RD(x, n) |  (v)))
#define HW_FMC_DATAW0SnLM_CLR(x, n, v) (HW_FMC_DATAW0SnLM_WR(x, n, HW_FMC_DATAW0SnLM_RD(x, n) & ~(v)))
#define HW_FMC_DATAW0SnLM_TOG(x, n, v) (HW_FMC_DATAW0SnLM_WR(x, n, HW_FMC_DATAW0SnLM_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW0SnLM bitfields
 */

/*!
 * @name Register FMC_DATAW0SnLM, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW0SnLM_data (0U)        /*!< Bit position for FMC_DATAW0SnLM_data. */
#define BM_FMC_DATAW0SnLM_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW0SnLM_data. */
#define BS_FMC_DATAW0SnLM_data (32U)       /*!< Bit field size in bits for FMC_DATAW0SnLM_data. */

/*! @brief Read current value of the FMC_DATAW0SnLM_data field. */
#define BR_FMC_DATAW0SnLM_data(x, n) (HW_FMC_DATAW0SnLM(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW0SnLM_data. */
#define BF_FMC_DATAW0SnLM_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW0SnLM_data) & BM_FMC_DATAW0SnLM_data)

