theatrus/ksdk/platform/CMSIS/Include/device/MK24F25612/MK24F25612_registers.h
/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW0SnLM_data(x, n, v) (HW_FMC_DATAW0SnLM_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW1SnUM - Cache Data Storage (uppermost word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW1SnUM - Cache Data Storage (uppermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * uppermost word (bits [127:96]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw1snum
{
    uint32_t U;
    struct _hw_fmc_dataw1snum_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [127:96] of data entry */
    } B;
} hw_fmc_dataw1snum_t;

/*!
 * @name Constants and macros for entire FMC_DATAW1SnUM register
 */
/*@{*/
#define HW_FMC_DATAW1SnUM_COUNT (4U)

#define HW_FMC_DATAW1SnUM_ADDR(x, n) ((uint32_t)(x) + 0x240U + (0x10U * (n)))

#define HW_FMC_DATAW1SnUM(x, n)  (*(__IO hw_fmc_dataw1snum_t *) HW_FMC_DATAW1SnUM_ADDR(x, n))
#define HW_FMC_DATAW1SnUM_RD(x, n) (HW_FMC_DATAW1SnUM(x, n).U)
#define HW_FMC_DATAW1SnUM_WR(x, n, v) (HW_FMC_DATAW1SnUM(x, n).U = (v))
#define HW_FMC_DATAW1SnUM_SET(x, n, v) (HW_FMC_DATAW1SnUM_WR(x, n, HW_FMC_DATAW1SnUM_RD(x, n) |  (v)))
#define HW_FMC_DATAW1SnUM_CLR(x, n, v) (HW_FMC_DATAW1SnUM_WR(x, n, HW_FMC_DATAW1SnUM_RD(x, n) & ~(v)))
#define HW_FMC_DATAW1SnUM_TOG(x, n, v) (HW_FMC_DATAW1SnUM_WR(x, n, HW_FMC_DATAW1SnUM_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW1SnUM bitfields
 */

/*!
 * @name Register FMC_DATAW1SnUM, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW1SnUM_data (0U)        /*!< Bit position for FMC_DATAW1SnUM_data. */
#define BM_FMC_DATAW1SnUM_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW1SnUM_data. */
#define BS_FMC_DATAW1SnUM_data (32U)       /*!< Bit field size in bits for FMC_DATAW1SnUM_data. */

/*! @brief Read current value of the FMC_DATAW1SnUM_data field. */
#define BR_FMC_DATAW1SnUM_data(x, n) (HW_FMC_DATAW1SnUM(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW1SnUM_data. */
#define BF_FMC_DATAW1SnUM_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW1SnUM_data) & BM_FMC_DATAW1SnUM_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW1SnUM_data(x, n, v) (HW_FMC_DATAW1SnUM_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW1SnMU - Cache Data Storage (mid-upper word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW1SnMU - Cache Data Storage (mid-upper word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-upper word (bits [95:64]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw1snmu
{
    uint32_t U;
    struct _hw_fmc_dataw1snmu_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [95:64] of data entry */
    } B;
} hw_fmc_dataw1snmu_t;

/*!
 * @name Constants and macros for entire FMC_DATAW1SnMU register
 */
/*@{*/
#define HW_FMC_DATAW1SnMU_COUNT (4U)

#define HW_FMC_DATAW1SnMU_ADDR(x, n) ((uint32_t)(x) + 0x244U + (0x10U * (n)))

#define HW_FMC_DATAW1SnMU(x, n)  (*(__IO hw_fmc_dataw1snmu_t *) HW_FMC_DATAW1SnMU_ADDR(x, n))
#define HW_FMC_DATAW1SnMU_RD(x, n) (HW_FMC_DATAW1SnMU(x, n).U)
#define HW_FMC_DATAW1SnMU_WR(x, n, v) (HW_FMC_DATAW1SnMU(x, n).U = (v))
#define HW_FMC_DATAW1SnMU_SET(x, n, v) (HW_FMC_DATAW1SnMU_WR(x, n, HW_FMC_DATAW1SnMU_RD(x, n) |  (v)))
#define HW_FMC_DATAW1SnMU_CLR(x, n, v) (HW_FMC_DATAW1SnMU_WR(x, n, HW_FMC_DATAW1SnMU_RD(x, n) & ~(v)))
#define HW_FMC_DATAW1SnMU_TOG(x, n, v) (HW_FMC_DATAW1SnMU_WR(x, n, HW_FMC_DATAW1SnMU_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW1SnMU bitfields
 */

/*!
 * @name Register FMC_DATAW1SnMU, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW1SnMU_data (0U)        /*!< Bit position for FMC_DATAW1SnMU_data. */
#define BM_FMC_DATAW1SnMU_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW1SnMU_data. */
#define BS_FMC_DATAW1SnMU_data (32U)       /*!< Bit field size in bits for FMC_DATAW1SnMU_data. */

/*! @brief Read current value of the FMC_DATAW1SnMU_data field. */
#define BR_FMC_DATAW1SnMU_data(x, n) (HW_FMC_DATAW1SnMU(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW1SnMU_data. */
#define BF_FMC_DATAW1SnMU_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW1SnMU_data) & BM_FMC_DATAW1SnMU_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW1SnMU_data(x, n, v) (HW_FMC_DATAW1SnMU_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW1SnML - Cache Data Storage (mid-lower word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW1SnML - Cache Data Storage (mid-lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-lower word (bits [63:32]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw1snml
{
    uint32_t U;
    struct _hw_fmc_dataw1snml_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [63:32] of data entry */
    } B;
} hw_fmc_dataw1snml_t;

/*!
 * @name Constants and macros for entire FMC_DATAW1SnML register
 */
/*@{*/
#define HW_FMC_DATAW1SnML_COUNT (4U)

#define HW_FMC_DATAW1SnML_ADDR(x, n) ((uint32_t)(x) + 0x248U + (0x10U * (n)))

#define HW_FMC_DATAW1SnML(x, n)  (*(__IO hw_fmc_dataw1snml_t *) HW_FMC_DATAW1SnML_ADDR(x, n))
#define HW_FMC_DATAW1SnML_RD(x, n) (HW_FMC_DATAW1SnML(x, n).U)
#define HW_FMC_DATAW1SnML_WR(x, n, v) (HW_FMC_DATAW1SnML(x, n).U = (v))
#define HW_FMC_DATAW1SnML_SET(x, n, v) (HW_FMC_DATAW1SnML_WR(x, n, HW_FMC_DATAW1SnML_RD(x, n) |  (v)))
#define HW_FMC_DATAW1SnML_CLR(x, n, v) (HW_FMC_DATAW1SnML_WR(x, n, HW_FMC_DATAW1SnML_RD(x, n) & ~(v)))
#define HW_FMC_DATAW1SnML_TOG(x, n, v) (HW_FMC_DATAW1SnML_WR(x, n, HW_FMC_DATAW1SnML_RD(x, n) ^  (v)))
/*@}*/

