theatrus/ksdk/platform/CMSIS/Include/device/MK24F25612/MK24F25612_registers.h
/*
 * Constants & macros for individual FMC_DATAW1SnML bitfields
 */

/*!
 * @name Register FMC_DATAW1SnML, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW1SnML_data (0U)        /*!< Bit position for FMC_DATAW1SnML_data. */
#define BM_FMC_DATAW1SnML_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW1SnML_data. */
#define BS_FMC_DATAW1SnML_data (32U)       /*!< Bit field size in bits for FMC_DATAW1SnML_data. */

/*! @brief Read current value of the FMC_DATAW1SnML_data field. */
#define BR_FMC_DATAW1SnML_data(x, n) (HW_FMC_DATAW1SnML(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW1SnML_data. */
#define BF_FMC_DATAW1SnML_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW1SnML_data) & BM_FMC_DATAW1SnML_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW1SnML_data(x, n, v) (HW_FMC_DATAW1SnML_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW1SnLM - Cache Data Storage (lowermost word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW1SnLM - Cache Data Storage (lowermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * lowermost word (bits [31:0]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw1snlm
{
    uint32_t U;
    struct _hw_fmc_dataw1snlm_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw1snlm_t;

/*!
 * @name Constants and macros for entire FMC_DATAW1SnLM register
 */
/*@{*/
#define HW_FMC_DATAW1SnLM_COUNT (4U)

#define HW_FMC_DATAW1SnLM_ADDR(x, n) ((uint32_t)(x) + 0x24CU + (0x10U * (n)))

#define HW_FMC_DATAW1SnLM(x, n)  (*(__IO hw_fmc_dataw1snlm_t *) HW_FMC_DATAW1SnLM_ADDR(x, n))
#define HW_FMC_DATAW1SnLM_RD(x, n) (HW_FMC_DATAW1SnLM(x, n).U)
#define HW_FMC_DATAW1SnLM_WR(x, n, v) (HW_FMC_DATAW1SnLM(x, n).U = (v))
#define HW_FMC_DATAW1SnLM_SET(x, n, v) (HW_FMC_DATAW1SnLM_WR(x, n, HW_FMC_DATAW1SnLM_RD(x, n) |  (v)))
#define HW_FMC_DATAW1SnLM_CLR(x, n, v) (HW_FMC_DATAW1SnLM_WR(x, n, HW_FMC_DATAW1SnLM_RD(x, n) & ~(v)))
#define HW_FMC_DATAW1SnLM_TOG(x, n, v) (HW_FMC_DATAW1SnLM_WR(x, n, HW_FMC_DATAW1SnLM_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW1SnLM bitfields
 */

/*!
 * @name Register FMC_DATAW1SnLM, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW1SnLM_data (0U)        /*!< Bit position for FMC_DATAW1SnLM_data. */
#define BM_FMC_DATAW1SnLM_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW1SnLM_data. */
#define BS_FMC_DATAW1SnLM_data (32U)       /*!< Bit field size in bits for FMC_DATAW1SnLM_data. */

/*! @brief Read current value of the FMC_DATAW1SnLM_data field. */
#define BR_FMC_DATAW1SnLM_data(x, n) (HW_FMC_DATAW1SnLM(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW1SnLM_data. */
#define BF_FMC_DATAW1SnLM_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW1SnLM_data) & BM_FMC_DATAW1SnLM_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW1SnLM_data(x, n, v) (HW_FMC_DATAW1SnLM_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW2SnUM - Cache Data Storage (uppermost word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW2SnUM - Cache Data Storage (uppermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * uppermost word (bits [127:96]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw2snum
{
    uint32_t U;
    struct _hw_fmc_dataw2snum_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [127:96] of data entry */
    } B;
} hw_fmc_dataw2snum_t;

/*!
 * @name Constants and macros for entire FMC_DATAW2SnUM register
 */
/*@{*/
#define HW_FMC_DATAW2SnUM_COUNT (4U)

#define HW_FMC_DATAW2SnUM_ADDR(x, n) ((uint32_t)(x) + 0x280U + (0x10U * (n)))

#define HW_FMC_DATAW2SnUM(x, n)  (*(__IO hw_fmc_dataw2snum_t *) HW_FMC_DATAW2SnUM_ADDR(x, n))
#define HW_FMC_DATAW2SnUM_RD(x, n) (HW_FMC_DATAW2SnUM(x, n).U)
#define HW_FMC_DATAW2SnUM_WR(x, n, v) (HW_FMC_DATAW2SnUM(x, n).U = (v))
#define HW_FMC_DATAW2SnUM_SET(x, n, v) (HW_FMC_DATAW2SnUM_WR(x, n, HW_FMC_DATAW2SnUM_RD(x, n) |  (v)))
#define HW_FMC_DATAW2SnUM_CLR(x, n, v) (HW_FMC_DATAW2SnUM_WR(x, n, HW_FMC_DATAW2SnUM_RD(x, n) & ~(v)))
#define HW_FMC_DATAW2SnUM_TOG(x, n, v) (HW_FMC_DATAW2SnUM_WR(x, n, HW_FMC_DATAW2SnUM_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW2SnUM bitfields
 */

/*!
 * @name Register FMC_DATAW2SnUM, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW2SnUM_data (0U)        /*!< Bit position for FMC_DATAW2SnUM_data. */
#define BM_FMC_DATAW2SnUM_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW2SnUM_data. */
#define BS_FMC_DATAW2SnUM_data (32U)       /*!< Bit field size in bits for FMC_DATAW2SnUM_data. */

/*! @brief Read current value of the FMC_DATAW2SnUM_data field. */
#define BR_FMC_DATAW2SnUM_data(x, n) (HW_FMC_DATAW2SnUM(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW2SnUM_data. */
#define BF_FMC_DATAW2SnUM_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW2SnUM_data) & BM_FMC_DATAW2SnUM_data)

