theatrus/ksdk/platform/CMSIS/Include/device/MK24F25612/MK24F25612_registers.h
/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW3SnMU_data(x, n, v) (HW_FMC_DATAW3SnMU_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW3SnML - Cache Data Storage (mid-lower word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW3SnML - Cache Data Storage (mid-lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3 . In
 * DATAWxSyUM, DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the
 * set, and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-lower word (bits [63:32]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw3snml
{
    uint32_t U;
    struct _hw_fmc_dataw3snml_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [63:32] of data entry */
    } B;
} hw_fmc_dataw3snml_t;

/*!
 * @name Constants and macros for entire FMC_DATAW3SnML register
 */
/*@{*/
#define HW_FMC_DATAW3SnML_COUNT (4U)

#define HW_FMC_DATAW3SnML_ADDR(x, n) ((uint32_t)(x) + 0x2C8U + (0x10U * (n)))

#define HW_FMC_DATAW3SnML(x, n)  (*(__IO hw_fmc_dataw3snml_t *) HW_FMC_DATAW3SnML_ADDR(x, n))
#define HW_FMC_DATAW3SnML_RD(x, n) (HW_FMC_DATAW3SnML(x, n).U)
#define HW_FMC_DATAW3SnML_WR(x, n, v) (HW_FMC_DATAW3SnML(x, n).U = (v))
#define HW_FMC_DATAW3SnML_SET(x, n, v) (HW_FMC_DATAW3SnML_WR(x, n, HW_FMC_DATAW3SnML_RD(x, n) |  (v)))
#define HW_FMC_DATAW3SnML_CLR(x, n, v) (HW_FMC_DATAW3SnML_WR(x, n, HW_FMC_DATAW3SnML_RD(x, n) & ~(v)))
#define HW_FMC_DATAW3SnML_TOG(x, n, v) (HW_FMC_DATAW3SnML_WR(x, n, HW_FMC_DATAW3SnML_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW3SnML bitfields
 */

/*!
 * @name Register FMC_DATAW3SnML, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW3SnML_data (0U)        /*!< Bit position for FMC_DATAW3SnML_data. */
#define BM_FMC_DATAW3SnML_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW3SnML_data. */
#define BS_FMC_DATAW3SnML_data (32U)       /*!< Bit field size in bits for FMC_DATAW3SnML_data. */

/*! @brief Read current value of the FMC_DATAW3SnML_data field. */
#define BR_FMC_DATAW3SnML_data(x, n) (HW_FMC_DATAW3SnML(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW3SnML_data. */
#define BF_FMC_DATAW3SnML_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW3SnML_data) & BM_FMC_DATAW3SnML_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW3SnML_data(x, n, v) (HW_FMC_DATAW3SnML_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW3SnLM - Cache Data Storage (lowermost word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW3SnLM - Cache Data Storage (lowermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3 . In
 * DATAWxSyUM, DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the
 * set, and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * lowermost word (bits [31:0]) of all 44 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw3snlm
{
    uint32_t U;
    struct _hw_fmc_dataw3snlm_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw3snlm_t;

/*!
 * @name Constants and macros for entire FMC_DATAW3SnLM register
 */
/*@{*/
#define HW_FMC_DATAW3SnLM_COUNT (4U)

#define HW_FMC_DATAW3SnLM_ADDR(x, n) ((uint32_t)(x) + 0x2CCU + (0x10U * (n)))

#define HW_FMC_DATAW3SnLM(x, n)  (*(__IO hw_fmc_dataw3snlm_t *) HW_FMC_DATAW3SnLM_ADDR(x, n))
#define HW_FMC_DATAW3SnLM_RD(x, n) (HW_FMC_DATAW3SnLM(x, n).U)
#define HW_FMC_DATAW3SnLM_WR(x, n, v) (HW_FMC_DATAW3SnLM(x, n).U = (v))
#define HW_FMC_DATAW3SnLM_SET(x, n, v) (HW_FMC_DATAW3SnLM_WR(x, n, HW_FMC_DATAW3SnLM_RD(x, n) |  (v)))
#define HW_FMC_DATAW3SnLM_CLR(x, n, v) (HW_FMC_DATAW3SnLM_WR(x, n, HW_FMC_DATAW3SnLM_RD(x, n) & ~(v)))
#define HW_FMC_DATAW3SnLM_TOG(x, n, v) (HW_FMC_DATAW3SnLM_WR(x, n, HW_FMC_DATAW3SnLM_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW3SnLM bitfields
 */

/*!
 * @name Register FMC_DATAW3SnLM, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW3SnLM_data (0U)        /*!< Bit position for FMC_DATAW3SnLM_data. */
#define BM_FMC_DATAW3SnLM_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW3SnLM_data. */
#define BS_FMC_DATAW3SnLM_data (32U)       /*!< Bit field size in bits for FMC_DATAW3SnLM_data. */

/*! @brief Read current value of the FMC_DATAW3SnLM_data field. */
#define BR_FMC_DATAW3SnLM_data(x, n) (HW_FMC_DATAW3SnLM(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW3SnLM_data. */
#define BF_FMC_DATAW3SnLM_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW3SnLM_data) & BM_FMC_DATAW3SnLM_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW3SnLM_data(x, n, v) (HW_FMC_DATAW3SnLM_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * hw_fmc_t - module struct
 ******************************************************************************/
/*!
 * @brief All FMC module registers.
 */
#pragma pack(1)
typedef struct _hw_fmc
{
    __IO hw_fmc_pfapr_t PFAPR;             /*!< [0x0] Flash Access Protection Register */
    __IO hw_fmc_pfb0cr_t PFB0CR;           /*!< [0x4] Flash Bank 0 Control Register */
    __I hw_fmc_pfb1cr_t PFB1CR;            /*!< [0x8] Flash Bank 1 Control Register */
    uint8_t _reserved0[244];
    __IO hw_fmc_tagvdw0sn_t TAGVDW0Sn[4];  /*!< [0x100] Cache Tag Storage */
    __IO hw_fmc_tagvdw1sn_t TAGVDW1Sn[4];  /*!< [0x110] Cache Tag Storage */
    __IO hw_fmc_tagvdw2sn_t TAGVDW2Sn[4];  /*!< [0x120] Cache Tag Storage */
    __IO hw_fmc_tagvdw3sn_t TAGVDW3Sn[4];  /*!< [0x130] Cache Tag Storage */
    uint8_t _reserved1[192];
    struct {
        __IO hw_fmc_dataw0snum_t DATAW0SnUM; /*!< [0x200] Cache Data Storage (uppermost word) */
        __IO hw_fmc_dataw0snmu_t DATAW0SnMU; /*!< [0x204] Cache Data Storage (mid-upper word) */
        __IO hw_fmc_dataw0snml_t DATAW0SnML; /*!< [0x208] Cache Data Storage (mid-lower word) */
        __IO hw_fmc_dataw0snlm_t DATAW0SnLM; /*!< [0x20C] Cache Data Storage (lowermost word) */
    } DATAW0Sn[4];
    struct {
        __IO hw_fmc_dataw1snum_t DATAW1SnUM; /*!< [0x240] Cache Data Storage (uppermost word) */
        __IO hw_fmc_dataw1snmu_t DATAW1SnMU; /*!< [0x244] Cache Data Storage (mid-upper word) */
        __IO hw_fmc_dataw1snml_t DATAW1SnML; /*!< [0x248] Cache Data Storage (mid-lower word) */
        __IO hw_fmc_dataw1snlm_t DATAW1SnLM; /*!< [0x24C] Cache Data Storage (lowermost word) */
    } DATAW1Sn[4];
    struct {
        __IO hw_fmc_dataw2snum_t DATAW2SnUM; /*!< [0x280] Cache Data Storage (uppermost word) */
        __IO hw_fmc_dataw2snmu_t DATAW2SnMU; /*!< [0x284] Cache Data Storage (mid-upper word) */
        __IO hw_fmc_dataw2snml_t DATAW2SnML; /*!< [0x288] Cache Data Storage (mid-lower word) */
        __IO hw_fmc_dataw2snlm_t DATAW2SnLM; /*!< [0x28C] Cache Data Storage (lowermost word) */
    } DATAW2Sn[4];
    struct {
        __IO hw_fmc_dataw3snum_t DATAW3SnUM; /*!< [0x2C0] Cache Data Storage (uppermost word) */
        __IO hw_fmc_dataw3snmu_t DATAW3SnMU; /*!< [0x2C4] Cache Data Storage (mid-upper word) */
        __IO hw_fmc_dataw3snml_t DATAW3SnML; /*!< [0x2C8] Cache Data Storage (mid-lower word) */
        __IO hw_fmc_dataw3snlm_t DATAW3SnLM; /*!< [0x2CC] Cache Data Storage (lowermost word) */
    } DATAW3Sn[4];
} hw_fmc_t;
#pragma pack()

