theatrus/ksdk/platform/CMSIS/Include/device/MK24F25612/MK24F25612_registers.h
/*
 * Constants & macros for individual MCM_PLACR bitfields
 */

/*!
 * @name Register MCM_PLACR, field ARB[9] (RW)
 *
 * Values:
 * - 0 - Fixed-priority arbitration for the crossbar masters
 * - 1 - Round-robin arbitration for the crossbar masters
 */
/*@{*/
#define BP_MCM_PLACR_ARB     (9U)          /*!< Bit position for MCM_PLACR_ARB. */
#define BM_MCM_PLACR_ARB     (0x00000200U) /*!< Bit mask for MCM_PLACR_ARB. */
#define BS_MCM_PLACR_ARB     (1U)          /*!< Bit field size in bits for MCM_PLACR_ARB. */

/*! @brief Read current value of the MCM_PLACR_ARB field. */
#define BR_MCM_PLACR_ARB(x)  (HW_MCM_PLACR(x).B.ARB)

/*! @brief Format value for bitfield MCM_PLACR_ARB. */
#define BF_MCM_PLACR_ARB(v)  ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_ARB) & BM_MCM_PLACR_ARB)

/*! @brief Set the ARB field to a new value. */
#define BW_MCM_PLACR_ARB(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_ARB) | BF_MCM_PLACR_ARB(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field SRAMUAP[25:24] (RW)
 *
 * Defines the arbitration scheme and priority for the processor and SRAM
 * backdoor accesses to the SRAM_U array.
 *
 * Values:
 * - 00 - Round robin
 * - 01 - Special round robin, favors SRAM backdoor accesses over the processor
 * - 10 - Fixed priority. Processor has highest, backdoor has lowest
 * - 11 - Fixed priority. Backdoor has highest, processor has lowest
 */
/*@{*/
#define BP_MCM_PLACR_SRAMUAP (24U)         /*!< Bit position for MCM_PLACR_SRAMUAP. */
#define BM_MCM_PLACR_SRAMUAP (0x03000000U) /*!< Bit mask for MCM_PLACR_SRAMUAP. */
#define BS_MCM_PLACR_SRAMUAP (2U)          /*!< Bit field size in bits for MCM_PLACR_SRAMUAP. */

/*! @brief Read current value of the MCM_PLACR_SRAMUAP field. */
#define BR_MCM_PLACR_SRAMUAP(x) (HW_MCM_PLACR(x).B.SRAMUAP)

/*! @brief Format value for bitfield MCM_PLACR_SRAMUAP. */
#define BF_MCM_PLACR_SRAMUAP(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_SRAMUAP) & BM_MCM_PLACR_SRAMUAP)

/*! @brief Set the SRAMUAP field to a new value. */
#define BW_MCM_PLACR_SRAMUAP(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_SRAMUAP) | BF_MCM_PLACR_SRAMUAP(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field SRAMUWP[26] (RW)
 *
 * When this bit is set, writes to SRAM_U array generates a bus error.
 */
/*@{*/
#define BP_MCM_PLACR_SRAMUWP (26U)         /*!< Bit position for MCM_PLACR_SRAMUWP. */
#define BM_MCM_PLACR_SRAMUWP (0x04000000U) /*!< Bit mask for MCM_PLACR_SRAMUWP. */
#define BS_MCM_PLACR_SRAMUWP (1U)          /*!< Bit field size in bits for MCM_PLACR_SRAMUWP. */

/*! @brief Read current value of the MCM_PLACR_SRAMUWP field. */
#define BR_MCM_PLACR_SRAMUWP(x) (HW_MCM_PLACR(x).B.SRAMUWP)

/*! @brief Format value for bitfield MCM_PLACR_SRAMUWP. */
#define BF_MCM_PLACR_SRAMUWP(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_SRAMUWP) & BM_MCM_PLACR_SRAMUWP)

/*! @brief Set the SRAMUWP field to a new value. */
#define BW_MCM_PLACR_SRAMUWP(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_SRAMUWP) | BF_MCM_PLACR_SRAMUWP(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field SRAMLAP[29:28] (RW)
 *
 * Defines the arbitration scheme and priority for the processor and SRAM
 * backdoor accesses to the SRAM_L array.
 *
 * Values:
 * - 00 - Round robin
 * - 01 - Special round robin, favors SRAM backdoor accesses over the processor
 * - 10 - Fixed priority. Processor has highest, backdoor has lowest
 * - 11 - Fixed priority. Backdoor has highest, processor has lowest
 */
/*@{*/
#define BP_MCM_PLACR_SRAMLAP (28U)         /*!< Bit position for MCM_PLACR_SRAMLAP. */
#define BM_MCM_PLACR_SRAMLAP (0x30000000U) /*!< Bit mask for MCM_PLACR_SRAMLAP. */
#define BS_MCM_PLACR_SRAMLAP (2U)          /*!< Bit field size in bits for MCM_PLACR_SRAMLAP. */

/*! @brief Read current value of the MCM_PLACR_SRAMLAP field. */
#define BR_MCM_PLACR_SRAMLAP(x) (HW_MCM_PLACR(x).B.SRAMLAP)

/*! @brief Format value for bitfield MCM_PLACR_SRAMLAP. */
#define BF_MCM_PLACR_SRAMLAP(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_SRAMLAP) & BM_MCM_PLACR_SRAMLAP)

/*! @brief Set the SRAMLAP field to a new value. */
#define BW_MCM_PLACR_SRAMLAP(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_SRAMLAP) | BF_MCM_PLACR_SRAMLAP(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field SRAMLWP[30] (RW)
 *
 * When this bit is set, writes to SRAM_L array generates a bus error.
 */
/*@{*/
#define BP_MCM_PLACR_SRAMLWP (30U)         /*!< Bit position for MCM_PLACR_SRAMLWP. */
#define BM_MCM_PLACR_SRAMLWP (0x40000000U) /*!< Bit mask for MCM_PLACR_SRAMLWP. */
#define BS_MCM_PLACR_SRAMLWP (1U)          /*!< Bit field size in bits for MCM_PLACR_SRAMLWP. */

/*! @brief Read current value of the MCM_PLACR_SRAMLWP field. */
#define BR_MCM_PLACR_SRAMLWP(x) (HW_MCM_PLACR(x).B.SRAMLWP)

/*! @brief Format value for bitfield MCM_PLACR_SRAMLWP. */
#define BF_MCM_PLACR_SRAMLWP(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_SRAMLWP) & BM_MCM_PLACR_SRAMLWP)

/*! @brief Set the SRAMLWP field to a new value. */
#define BW_MCM_PLACR_SRAMLWP(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_SRAMLWP) | BF_MCM_PLACR_SRAMLWP(v)))
/*@}*/

/*******************************************************************************
 * HW_MCM_ISCR - Interrupt Status Register
 ******************************************************************************/

/*!
 * @brief HW_MCM_ISCR - Interrupt Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCM_ISCR register includes the enable and status bits associated with the
 * core's floating-point exceptions. The individual event indicators are first
 * qualified with their exception enables and then logically summed to form an
 * interrupt request sent to the core's NVIC. Bits 15-8 are read-only indicator
 * flags based on the processor's FPSCR register. Attempted writes to these bits are
 * ignored. Once set, the flags remain asserted until software clears the
 * corresponding FPSCR bit.
 */
typedef union _hw_mcm_iscr
{
    uint32_t U;
    struct _hw_mcm_iscr_bitfields
    {
        uint32_t RESERVED0 : 8;        /*!< [7:0]  */
        uint32_t FIOC : 1;             /*!< [8] FPU invalid operation interrupt status */
        uint32_t FDZC : 1;             /*!< [9] FPU divide-by-zero interrupt status */
        uint32_t FOFC : 1;             /*!< [10] FPU overflow interrupt status */
        uint32_t FUFC : 1;             /*!< [11] FPU underflow interrupt status */
        uint32_t FIXC : 1;             /*!< [12] FPU inexact interrupt status */
        uint32_t RESERVED1 : 2;        /*!< [14:13]  */
        uint32_t FIDC : 1;             /*!< [15] FPU input denormal interrupt status */
        uint32_t RESERVED2 : 8;        /*!< [23:16]  */
        uint32_t FIOCE : 1;            /*!< [24] FPU invalid operation interrupt enable
                                        * */
        uint32_t FDZCE : 1;            /*!< [25] FPU divide-by-zero interrupt enable */
        uint32_t FOFCE : 1;            /*!< [26] FPU overflow interrupt enable */
        uint32_t FUFCE : 1;            /*!< [27] FPU underflow interrupt enable */
        uint32_t FIXCE : 1;            /*!< [28] FPU inexact interrupt enable */
        uint32_t RESERVED3 : 2;        /*!< [30:29]  */
        uint32_t FIDCE : 1;            /*!< [31] FPU input denormal interrupt enable */
    } B;
} hw_mcm_iscr_t;

/*!
 * @name Constants and macros for entire MCM_ISCR register
 */
/*@{*/
#define HW_MCM_ISCR_ADDR(x)      ((uint32_t)(x) + 0x10U)

#define HW_MCM_ISCR(x)           (*(__IO hw_mcm_iscr_t *) HW_MCM_ISCR_ADDR(x))
#define HW_MCM_ISCR_RD(x)        (HW_MCM_ISCR(x).U)
#define HW_MCM_ISCR_WR(x, v)     (HW_MCM_ISCR(x).U = (v))
#define HW_MCM_ISCR_SET(x, v)    (HW_MCM_ISCR_WR(x, HW_MCM_ISCR_RD(x) |  (v)))
#define HW_MCM_ISCR_CLR(x, v)    (HW_MCM_ISCR_WR(x, HW_MCM_ISCR_RD(x) & ~(v)))
#define HW_MCM_ISCR_TOG(x, v)    (HW_MCM_ISCR_WR(x, HW_MCM_ISCR_RD(x) ^  (v)))
/*@}*/

